-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2021-06-27 11:58:04
-- 伺服器版本： 10.4.19-MariaDB
-- PHP 版本： 8.0.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `網設專題`
--

-- --------------------------------------------------------

--
-- 資料表結構 `milkshop_price`
--

CREATE TABLE `milkshop_price` (
  `id` varchar(5) NOT NULL,
  `品名` varchar(15) NOT NULL,
  `容量` varchar(2) NOT NULL,
  `價格` int(3) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `milkshop_price`
--

INSERT INTO `milkshop_price` (`id`, `品名`, `容量`, `價格`) VALUES
('S001', '珍珠大正紅茶拿鐵', 'M', 55),
('S002', '珍珠大正紅茶拿鐵', 'L', 65),
('S003', '珍珠伯爵紅茶拿鐵', 'M', 55),
('S004', '珍珠伯爵紅茶拿鐵', 'L', 65),
('S005', '芋圓茉香綠茶拿鐵', 'M', 60),
('S006', '芋圓茉香綠茶拿鐵', 'L', 70),
('S007', '手感芋圓芋泥鮮奶', 'M', 75),
('S008', '手感芋圓芋泥鮮奶', 'L', 95),
('S009', '珍珠手炒黑糖鮮奶', 'M', 70),
('S010', '珍珠手炒黑糖鮮奶', 'L', 90),
('S011', '雙Q琥珀烏龍拿鐵', 'L', 80),
('S012', '仙草凍冬瓜茶', 'L', 40),
('S101', '手炒黑糖鮮奶', 'M', 60),
('S102', '手炒黑糖鮮奶 ', 'L', 80),
('S103', '嫩仙草凍奶', 'M', 65),
('S104', '嫩仙草凍奶', 'L', 85),
('S105', '手感芋圓鮮奶', 'M', 70),
('S106', '手感芋圓鮮奶', 'L', 90),
('S107', '法芙娜純可可鮮奶', 'M', 60),
('S108', '法芙娜純可可鮮奶', 'L', 80),
('S109', '宇治焙茶鮮奶', 'M', 65),
('S110', '宇治焙茶鮮奶', 'L', 85),
('S111', '出雲抹茶鮮奶', 'M', 70),
('S112', '出雲抹茶鮮奶', 'L', 90),
('S113', '冬瓜鮮奶', 'M', 60),
('S114', '冬瓜鮮奶', 'L', 80),
('S115', '珍珠鮮奶', 'M', 65),
('S116', '珍珠鮮奶', 'L', 85),
('S117', '紅豆鮮奶', 'M', 65),
('S118', '紅豆鮮奶', 'L', 85),
('S119', '布丁鮮奶', 'M', 65),
('S120', '布丁鮮奶', 'L', 85),
('S121', '芋頭鮮奶', 'M', 65),
('S122', '芋頭鮮奶', 'L', 85),
('S201', '大正紅茶拿鐵', 'M', 45),
('S202', '大正紅茶拿鐵', 'L', 55),
('S203', '伯爵紅茶拿鐵', 'M', 45),
('S204', '伯爵紅茶拿鐵', 'L', 55),
('S205', '琥珀烏龍拿鐵', 'M', 45),
('S206', '琥珀烏龍拿鐵', 'L', 55),
('S207', '茉香緣茶拿鐵', 'M', 45),
('S208', '茉香緣茶拿鐵', 'L', 55),
('S209', '原片青茶拿鐵', 'M', 45),
('S210', '原片青茶拿鐵', 'L', 55),
('S211', '焙香大麥拿鐵', 'M', 45),
('S212', '焙香大麥拿鐵', 'L', 55),
('S213', '醇濃紅茶鮮豆奶', 'L', 55),
('S214', '醇濃伯爵紅茶鮮豆奶', 'L', 55),
('S215', '焙香決明大麥鮮豆奶', 'L', 55),
('S216', '初露青茶鮮豆奶', 'M', 55),
('S217', '琥珀烏龍鮮豆奶', 'L', 55),
('S218', '茉香緣茶鮮豆奶', 'L', 55),
('S301', '英倫伯爵紅茶', 'L', 35),
('S302', '大正醇香紅茶', 'L', 30),
('S303', '焙香決明大麥', 'L', 25),
('S304', '琥珀高峰烏龍', 'L', 30),
('S305', '茉莉原淬綠茶', 'L', 30),
('S306', '原片初露青茶', 'L', 30),
('S307', '原鄉冬瓜茶', 'L', 30),
('S308', '沉香烏龍', 'L', 70),
('S309', '小山見晴', 'L', 70),
('S310', '青採翠玉', 'L', 40),
('S401', '冬瓜麥茶', 'L', 35),
('S402', '冬瓜青茶', 'L', 40),
('S403', '冬瓜檸檬', 'L', 45),
('S404', '冰糖洛神梅', 'L', 45),
('S405', '茉香洛神冰沙', 'L', 45),
('S406', '蜂農花蜜茶', 'L', 45),
('S407', '水漾檸紅', 'L', 35),
('S408', '水漾檸綠', 'L', 35),
('S409', '冰萃檸檬', 'L', 55),
('S410', '冰萃柳丁', 'L', 55),
('S411', '青檸香茶', 'L', 60),
('S412', '香柚綠茶', 'L', 50),
('S413', '養樂多綠', 'L', 50),
('S414', '柳丁綠茶', 'L', 60),
('S415', '柳丁青茶', 'L', 60),
('S416', '白甘蔗青茶', 'L', 60),
('S417', '香濃芝麻鮮奶', 'M', 60),
('S418', '紅豆芝麻鮮奶', 'M', 65),
('S419', '慢火窯燒桂圓鮮奶', 'M', 65),
('S420', '慢火窯燒桂圓紅棗茶', 'L', 65),
('S421', '草莓庫莉鮮奶', 'M', 75),
('S422', '莓妍多多', 'M', 65),
('S423', '草莓庫莉翡綠', 'L', 65),
('S424', '蔓莓花漾', 'L', 70),
('S425', '阿文鮮梅綠', 'L', 55);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `milkshop_price`
--
ALTER TABLE `milkshop_price`
  ADD PRIMARY KEY (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
